app/Models/ProductModel.php

SELECT *
FROM `products`
---
    public function getproduct()
    {
        return $this->db->table($this->table)->get()->getResultArray();